import pandas as pd
import numpy as np

In [3]:
x_value = np.arange(40).reshape(20,2)
y_value = np.arange(20)

In [7]:
sample_df = pd.DataFrame(np.column_stack((x_value,y_value)),columns=['x_1','x_2','result'])

In [8]:
x_value = np.arange(40).reshape(20,2)
y_value = np.arange(20)

In [10]:
print(sample_df.shape)
sample_df.head()

(20, 3)

   x_1  x_2  result
0    0    1       0
1    2    3       1
2    4    5       2
3    6    7       3
4    8    9       4

In [11]:
sample_df.sample(n=5, random_state=1001)

    x_1  x_2  result
1     2    3       1
15   30   31      15
0     0    1       0
2     4    5       2
18   36   37      18

In [12]:
sample_df.sample(frac=0.5, random_state=1001)

    x_1  x_2  result
1     2    3       1
15   30   31      15
0     0    1       0
2     4    5       2
18   36   37      18
7    14   15       7
10   20   21      10
6    12   13       6
19   38   39      19
4     8    9       4

In [13]:
rep_df = sample_df.sample(frac=0.2,random_state=1001)
rep_df.head()

    x_1  x_2  result
1     2    3       1
15   30   31      15
0     0    1       0
2     4    5       2

In [14]:
replace=True
rep_df.sample(n=10, replace=True, random_state=1001)

    x_1  x_2  result
15   30   31      15
15   30   31      15
15   30   31      15
0     0    1       0
0     0    1       0
2     4    5       2
1     2    3       1
1     2    3       1
0     0    1       0
2     4    5       2

In [16]:
sample_df.sample(n=5, weights='result')

    x_1  x_2  result
13   26   27      13
11   22   23      11
9    18   19       9
14   28   29      14
8    16   17       8

In [17]:
def sysmetic_sampling(data,n) :
    count = len(data)
    sample_count = count // n
    index = data[:sample_count].sample(1).index
    intoin = index - 0
    sys_df = pd.DataFrame()
    while len(sys_df) < n :
        sys_df = sys_df.append(data.loc[index,:])
        index += sample_count
    return(sys_df)

In [18]:
sysmetic_sampling(sample_df,5)

C:\Users\user\AppData\Local\Temp\ipykernel_13796\165995926.py:8: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  sys_df = sys_df.append(data.loc[index,:])
C:\Users\user\AppData\Local\Temp\ipykernel_13796\165995926.py:8: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  sys_df = sys_df.append(data.loc[index,:])
C:\Users\user\AppData\Local\Temp\ipykernel_13796\165995926.py:8: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  sys_df = sys_df.append(data.loc[index,:])
C:\Users\user\AppData\Local\Temp\ipykernel_13796\165995926.py:8: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  sys_df = sys_df.append(data.loc[index,:])
C:\Users\user\AppData\Local\Temp\ipykernel_13796\165995926.py:8: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  sys_df = sys_df.append(data.loc[index,:])

    x_1  x_2  result
1     2    3       1
5    10   11       5
9    18   19       9
13   26   27      13
17   34   35      17

In [40]:
from sklearn.model_selection import StratifiedShuffleSplit
splitfi = StratifiedShuffleSplit(n_splits=1, test_size=0.3,random_state=1001)

In [41]:
sample_df.head(3)

   x_1  x_2  result  group
0    0    1       0      0
1    2    3       1      0
2    4    5       2      0

In [42]:
group = [0,0,0,0,0,0,0,0,0,0,1,1,1,1,1,1,1,1,1,1]
sample_df['group'] = group

In [43]:
sample_df['group']=group

In [44]:
sample_df["group"].value_counts()

0    10
1    10
Name: group, dtype: int64

In [45]:
for train_idx, test_idx in splitfi.split(sample_df, sample_df['group']):
    print("Train:",train_idx,"Test:",test_idx)
    df_strat_train = sample_df.loc[train_idx]
    df_strat_test = sample_df.loc[test_idx]

Train: [13  7  1 14 16 12  0 11 10 18  2  8  5  6] Test: [17 19  3 15  4  9]

In [46]:
print("Train data 수확인")
print(df_strat_train.shape)
print("Train data 수확인")
print(df_strat_test.shape)

Train data 수확인
(14, 4)
Train data 수확인
(6, 4)

In [47]:
print("전체 비율")
print(sample_df["group"].value_counts()/len(sample_df))
print("Train data 비율")
print(df_strat_train["group"].value_counts()/len(df_strat_train))
print("Test data 비율")
print(df_strat_test["group"].value_counts()/len(df_strat_test))

전체 비율
0    0.5
1    0.5
Name: group, dtype: float64
Train data 비율
1    0.5
0    0.5
Name: group, dtype: float64
Test data 비율
1    0.5
0    0.5
Name: group, dtype: float64